Autodesk.Revit.DB.PropertySetElement.Duplicate(Autodesk.Revit.DB.Document,System.String)
Creates a duplicate of this PropertySetElement.
document:
The document in which to create the PropertySetElement.
name:
The name to use for the new PropertySetElement.
Returns:
The new PropertySetElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for name is already in use as a property set name.
-or-
name is an empty string.
-or-
name cannot include prohibited characters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012